<template>
  <div class="privacy">
    <div class="container">
      <div class="row">
        <div class="col-md-8 col-md-offset-2 col-sm-12">
          <ul class="nav nav-tabs" role="tablist">
            <li v-bind:class="{'active': current == 'terms'}"><a href="#terms" v-on:click="current = 'terms'" data-toggle="tab">服务协议</a></li>
            <li v-bind:class="{'active': current == 'privacy'}"><a href="#privacy" v-on:click="current = 'privacy'" data-toggle="tab">隐私政策</a></li>
          </ul>
          <div class="tab-content">
            <div class="tab-pane active" id="terms">
              <p>
                本网站由上海晓易信息技术有限公司（以下简称“晓易信息”）运营并管理，提供互联网基础信息分析以及信息有效性验证服务（包括但不限于IP地址查询、手机号码归属地查询、银行卡号归属地查询、身份证号验真、银行卡验真等）。本《服务协议》中的使用条款只适用于本网站的服务并不适用于晓易信息拥有的其他网站和服务。请使用由晓易信息提供的服务、功能和内容之前仔细阅读本《服务协议》（本协议内容包括上海晓易信息技术有限公司《隐私政策》）。一旦您使用本网站的服务，即代表您认同本《服务协议》中的条款具有法律约束力。
              </p>
              <h2>接受条款</h2>
              <p>
                请仔细阅读以下的使用条款、其他规则、我们通过服务不定时和您沟通的指南，以及附加条款，因为这些条款在您和晓易信息之间确立了具有法律约束力的合同。不管您是一个网站的访客（游客）还是注册并付费访问本网站的个人（“最终用户”），均表示您已阅读、理解、同意受其约束，并遵守这些条款。如果您不同意以下任何内容，您应当立即停止访问本网站或使用本网站服务。（除非特别声明，术语“您”，是指一个访问者、最终用户）。
              </p>
              <p>
                通过注册或者其他方式，包括但不仅限于访问、浏览和使用本网站服务，即表示您同意晓易信息已发布的服务条款和其他操作规则、政策和程序，包含可能在未通知您的情况下不定时引入的更新。
              </p>
              <p>
                某些服务可能是受晓易信息规定的、并不时更新的附加条款和条件约束；您使用这些服务时同样受本《服务协议》引用的这些附加条款和条件约束。
              </p>
              <p>
                这些服务条款适用于本服务的所有使用者，包括但不仅限于内容提供者、信息、其他材料和服务的使用者，注册用户或其他。
              </p>
              <h2>协议变更</h2>
              <p>
                晓易信息保留其自行决定更改和替换本《服务协议》中任何条款的权利以及在任何时间通过公告或者发送通知或邮件的方式改变、暂停或终止服务的权利。晓易信息可以在未通知您的情况下对本网站服务的某些功能增加限制或者限制您访问部分或全部服务。您有责任定期查看这些条款的变更，在变更后的《服务协议》发布后您继续使用本服务即表示您接受这些变更。
              </p>
              <h2>适用范围</h2>
              <p>
                使用本服务的个人年龄应为至少18 岁。使用本服务即表示您已年满18岁，您完全可以并有能力遵守这些条款、条件、义务和约定。您声明并保证您是年满18岁。如果您在18岁以下，您可能在任何情况下都不能使用本服务。 晓易信息可以自行决定，拒绝提供服务给任何个人或实体，并随时更改申请资格。
              </p>
              <p>
                如果您是代表公司、实体、组织或任何上述各方的组或部门（统称为“组织”）使用本服务，那么您代表并保证：您是组织授权的权威代表，并同意代表该组织受这些条款的约束。您负责确保这些服务条款符合所有适用于您的法律、法规和规章，当这些服务条款或服务的使用被禁止或出售、提供服务在某种程度上与适用的法律、法规相冲突时，您访问本服务的权利将被取消。
              </p>
              <p>
                此外，本服务仅授权您或您代表的组使用，而不提供给任何第三方使用或受益。
              </p>
              <h2>用户注册</h2>
              <p>
                虽然服务的某些功能提供给未注册的用户，但是为了使用服务更广泛的功能您必须注册（创建一个账户）。为了注册，您必须提供准确的电子邮件地址或手机号作为用户名。您负责更新您提供给晓易信息的、与您的帐户关联的电子邮件地址的准确性。您不能：1.以冒充他人的意图来选择使用他人的邮件地址或者手机号；2.使用不属于您或您代表组织的邮件地址或者手机号；3.使用无法送达信息的邮件地址或者手机号。
              </p>
              <h2>账户安全</h2>
              <p>
                您对您账户的活动和安全负全部责任。未经允许您不能使用其他账户。如果您的账户出现安全或非法使用的问题请立即联系我们。您不应该公布、共享或发布您账户的登录信息。
              </p>
              <h2>所有权声明</h2>
              <p>
                本服务由上海晓易信息技术有限公司拥有并运营。本网站的可视化界面、多媒体内容（包括音乐作品和录音）、特征信息、图形、设计、编译、计算机代码、软件产品以及由晓易信息提供的服务中的其他材料是晓易信息或者其授权专利和知识产权。这些材料不包括用户内容（如在知识产权政策中定义，包括但不限于链接）晓易信息的材料受适用法律、法规和有关知识产权或专有财产法规的保护，包括但不限于：专利、版权、商标、商业秘密的法律。您同意不复制、分发、展示、修改、创造衍生产品、发布、销售、许可，或编辑任何晓易信息材料。任何违反这些条款或适用的许可而试图下载、打印、发布或保存晓易信息材料、分发晓易信息材料的副本，或其他违反知识产权或其他专有权利利用晓易信息材料的行为都是这些条款所严格禁止的。
              </p>
              <h2>服务内容</h2>
              <p>
                本服务允许：
                <br>
                1．通过本网站提供的URL或者客户端使用查询服务；
                <br><br>
                2．下载或购买离线数据库自行利用本站授权的数据；
                <br><br>
                3．晓易信息目前对部分功能不收取费用。然而，我们为了更有效的定制广告给您可能会收集信息，这在本网站的《隐私政策》中有更详尽的阐述。
                <br>
                <br>
                收费和充值服务:
                <br>
                1．用户应按照实际需求进行充值和消费，已消费金额不予退款
                <br><br>
                2．用户违反服务条款或者所在国法律导致帐号被我站封禁，付费服务将被停止且不予退款
                <br><br>
                3．账户余额资金仅在我站无法继续履行增值服务时退款，因用户个人原因不予退款
              </p>
              <h2>使用许可</h2>
              <p>
                遵照这些服务条款，晓易信息授予本服务的每个用户一个全球性、非排他性、不可分许可的、不可转让的使用内容的许可，仅供个人，非商业用途来使用部分服务。以非个人和商业目的使用、复制、修改，分发或存储任何内容是明确禁止的。如果您想将次服务用于商业用途，则必须与我们联系。
              </p>
              <h2>许可授权</h2>
              <p>
                （1）授权给晓易信息
                <br><br>
                通过本服务提交用户内容，您应给予晓易信息一个全球性、非排他性的、免版税的、完全付清，再授权及转让的使用许可去使用、编辑、修改、复制、发行、制作衍生作品、展示、执行等充分开发与本服务和晓易信息商业活动有关的用户内容，包括但不限于以任何媒体形式通过任何媒体通道（包括但不限于第三方网站和种子）宣传和重新分发全部或部分服务（及其衍生作品）。
                <br><br>
                （2）授权给用户
                <br><br>
                您在此应给予服务的每个用户非排他性的许可去通过服务来访问您的用户内容，以及使用、编辑、修改、复制、发行，制作展示衍生作品和执行此类用户内容。
                <br><br>
                （3）没有侵权
                <br><br>
                您在此应给予服务的每个用户非排他性的许可使其通过服务来访问您的用户内容，以及使用、编辑、修改、复制、发行，制作展示衍生作品和执行此类用户内容。
              </p>
              <h2>可用性内容</h2>
              <p>
                晓易信息不保证服务可以提供任何内容。此外，晓易信息没有义务监督服务。但是晓易信息保留以下权利：（1）在任何时候，在不通知您的前提下，以任何理由（包括但不限于，在收到来自第三方或当局有关这些内容的索赔或指控时，或者晓易信息认为您已经违反了这些服务条款）删除、编辑或修改自行决定的任何内容；（2）删除或阻止本服务的任何内容。
              </p>
              <h2>行为准则</h2>
              <p>
                1．在使用本网站服务时请保证不将服务用于本《服务协议》禁止的目的，同时您将对服务相关的所有活动负责。
                <br><br>
                2．您不得，也不得允许任何第三方采取任何行动或上传、下载、发布、提交、分发或促进服务上内容的分发（包括用户内容）：
                <br><br>
                （1）侵犯专利权、商标权、商业秘密、版权、公开权或其他人或实体的权利，或违反任何法律或合同义务；
                <br>
                （2）对晓易信息的材料或用户内容或任何其他部分，在法律允许的范围之外进行从事、引起、允许或授权修改、创作衍生作品、翻译、逆向工程、编译，反编译、拆卸、黑客服务或其他活动；
                <br>
                （3）在这些条款允许的范围之外再现、复制、拷贝、销售、交易、转售、分发或开发、服务、使用服务、访问服务或通过服务获取内容（包括但不限于晓易信息的材料和用户内容）；
                <br>
                （4）以比较和竞争分析的目的访问和使用本服务；
                <br>
                （5）对服务安全相关的功能、阻止或限制使用或复制服务部分内容的功能、限制服务或内容的功能进行删除、规避、禁用、损坏或干扰；
                <br>
                （6）使用任何机器人、蜘蛛、爬虫或其他任何形式的自动化手段来访问服务、仅在这些条款的允许范围内的服务的功能、服务上内容或功能的深层链接或未经我们书面许可以任何目的附上我们的商标或部分服务，或者其他我们用来限制服务访问的手段；
                <br>
                （7）含有威胁、辱骂、骚扰、诽谤、中伤、欺诈、侵犯他人隐私等非法内容；
                <br>
                （8）未经授权的广告、垃圾或群发邮件（垃圾邮件）；
                <br>
                （9）发布、分发或传播任何不恰当的、粗俗、诽谤、侵权、淫秽、非法的、攻击性的，不道德或其他不良的材料或信息；
                <br>
                （10）创建虚假身份或以误导他人的目的冒充寄件人身份或信息来源，包括但不限于提供给服务反馈系统误导性信息。
                <br>
                （11）传播或上传含有病毒、木马程序、蠕虫、轰炸程序或其他有害、有毒的软件程序；
                <br>
                （12）重定向，分发或从其他用户的帐户秘密收集私人信息（“网络钓鱼”）；
                <br>
                （13）包含用于破坏、损害、限制或干涉任何软件、硬件或通讯设备应有的功能，非法访问系统数据、密码或其他晓易信息或第三方信息的软件病毒或其他计算机代码、文件或程序；
                <br>
                （14）冒充任何个人或实体，包括任何员工或代表晓易信息；
                <br>
                （15）包括他人的身份证明文件或敏感的财务信息；
                <br>
                （16）干扰或中断服务、网络或与服务有关的服务器，或者违反违反网络或服务器的规则、政策或程序；
                <br>
                （17）上传、发布或传播未经授权的或违法的广告、促销材料、垃圾邮件、连锁信、促销方案或其他形式的邀约（商业或其他）；
                <br>
                以任何可能导致违反法律法规的方式使用本服务,由晓易信息自行决定的其他行为
                <br><br>
                3．您不得：（1）采取任何可能施加给（由晓易信息单方面确定）晓易信息（或其第三方供应商）的基础设施不合理或不相称的大负荷的行动； （2）干扰或试图干扰服务或服务管理的其他活动的正常运行； （3）绕过晓易信息用以防止或限制访问服务（或其他账户、电计算机系统或与服务相关的网络）的任何措施； （4）在服务上运行任何形式的自动应答或“垃圾邮件”； （5）用手动或自动软件、设备、或其他进程抓取或“蜘蛛”服务的任何页； （6）从服务中窃取内容；（7）其他违反晓易信息的方针和政策的任何行动。
                <br><br>
                4．您不得（直接或间接）：（1）在适用法律禁止的范围内破译、反编译、反汇编，逆向工程或以其他方式试图获得任何源代码或相关服务的任何方面的特征的想法或算法； （2）修改、翻译，或创建服务的任何部分的衍生作品；（3）复制、出租、租赁，分发或以其他方式转让任何您在本协议项下的权利。您应遵守所有适用的国家和国际法律、法规的规定。
                <br><br>
                5. 晓易信息保留在必要时访问、读取、保存和披露任何信息的权利：（1）遵守所有适用法律，法规，法律程序或应政府要求； （2）执行本《服务协议》，其中包括对潜在的违规行为展开调查； （3）检测，防止或解决欺诈、安全或技术问题； （4）响应用户的支持请求；（5）保护晓易信息及其用户和公众的权利、财产和安全。这包括与其他公司和组织为防止欺诈和阻止垃圾邮件而交换信息。
              </p>
              <h2>第三方内容，链接和服务</h2>
              <p>
                分享或连接到本服务的内容可能包含引用或链接的不受晓易信息及其供应商和许可方控制的第三方的材料和服务（包括但不限于第三方网站）。
                <br><br>
                晓易信息为了方便您提供了这样的信息和链接，不应该认为我们推荐此类网站及其上的内容、产品或信息。本服务可允许您链接到互联网上的其他网站、服务或资源，其他服务或资源也可能包含本服务的链接。当您访问互联网上的第三方资源时，您需要自己承担风险。这些其他资源不在晓易信息的控制之下，您承认晓易信息不对这些网站和资源的内容、功能、准确性、合法性、适当性，或任何其他方面负责。此类链接中包含的内容并不意味着晓易信息或其运营商认可和推荐。您的通信、商业往来或通过服务参与的促销活动完全是您与广告商之间的活动。您同意晓易信息对于此类交易或广告服务的任何结果、损失或损害不负任何责任。另外当您离开本服务时（比如通过点击一个链接）这些条款也不再生效，您应该查看您访问的第三方网站、软件或服务的使用条款和政策包括相关的《隐私政策》。
              </p>
              <h2>服务的终止</h2>
              <p>
                1．由晓易信息终止服务。 晓易信息，自行决定以任何理由或没有理由在任何时间终止用户对服务（或其任何部分）的访问，终止服务和所有相关的服务，包括支持（或其任何部分），或终止本协议授予您的任何许可而无须另行通知。您同意晓易信息不对您或任何第三方的服务终止负责。 晓易信息不允许在服务中进行非法、侵权、欺诈或其他非法活动，并有权在实际或涉嫌欺诈，或违反本条款及其他法律、法规时暂停或终止服务。任何涉嫌欺诈，滥用或非法活动均由相关执法部门负责。 晓易信息没有任何责任提供或允许您访问您的用户内容或因使用服务而存储的其他信息。
                <br><br>
                2．由您（用户）终止服务。如果您不满意的服务，请发送邮件至 service@risktogo.com 让我们知道。如果您对于服务、任何条款、晓易信息经营服务的任何政策或做法、任何内容或通过服务所传送或使用的信息不满意而想要终止服务，您可以采取以下措施：（1）关闭您的帐户并停止对服务的使用；（2）通过 service@riskto.com 提供终止通知给晓易信息。
                <br><br>
                3．在终止时的权利和义务。在这些条款终止之后，您使用该服务的权利将立即终止。
              </p>
              <h2>免责声明</h2>
              <p>
                1. 晓易信息与您没有任何特殊关系或信托责任。您承认晓易信息在没有支配和采取下列相关行动的责任：
                <br>
                哪些用户能访问服务；
                通过服务可以访问那些内容；
                这些内容将会对您产生什么影响；
                您怎样解释和使用这些内容；
                内容被披露您可以采取那些行动。
                <br><br>
                2．您，而不是晓易信息对您从服务中获得的或没获得的内容负责。晓易信息不代表任何包含的内容或者通过服务访问的内容，晓易信息也不对这些内容的准确性、版权合规性、合法性或包含或材料的系统性负责。
                <br><br>
                3. 明确否认。晓易信息及其董事、员工、代理商、供应商、合作伙伴和内容提供商不保证：（1）本服务将在任何特定时间或地点安全或可用； （2）每一个缺陷或错误都将得到纠正； （3）通过服务得到的内容或软件都不含有病毒或有害成分；（4）使用服务可以满足您的需要。您对服务的使用是完全由您自己承担风险。
                <br><br>
                4. 晓易信息不保证任何本服务上的或连接到服务的其他网站传送的通讯或信息的机密性和隐私性。 晓易信息也不保证电子邮件地址、登记和识别信息，磁盘空间、商业秘密或机密信息，存储在晓易信息的设备的任何其他内容、由服务访问网络传输的内容或者与服务使用有关的其他内容的隐私性。
              </p>
              <h2>赔偿</h2>
              <p>
                您应维护、赔偿和保证晓易信息、其附属公司及其各自的员工、承包商、董事免于由于您访问、使用或滥用本服务、内容、用户内容、您或者第三方使用您的账户违反服务协议、侵犯个人或实体的知识产权而引起的负债、索赔和费用，包括合理的律师费。晓易信息保留防御和控制的权利，在这种情况下，您将协助和维护晓易信息的权利。
              </p>
              <h2>责任限制</h2>
              <p>
                在任何情况下晓易信息、其附属公司及其各自的员工、承包商、董事，代理商、合作伙伴、供应商、代表或内容提供商都会承担合同责任、绝不侵权或违反关于服务的法律法规：（1）利润损失、数据丢失、采购替代商品或服务，或任何种类的特殊的，直接的，间接的，附带的，惩罚性的或后果性损害，替代商品或服务（不论如何产生）的成本；（2）任何错误，病毒，木马等（不论其来自何处的来源）。
                <br><br>
                免责声明：服务（包括但不限于任何内容，或者晓易信息提供的其他服务或信息）、用户内容和任何第三方媒体、内容、软件、服务带有或提供的的服务或应用程序都在“原样”、“可用”、“包含所有缺陷”的基础上提供的，不以任何形式保证，包括但不限于正确性、准确性、可靠性或其他方面。
                <br><br>
                为了在最大程度上遵守适用法律，晓易信息及其附属公司、合作伙伴、许可人和供应商在此否认所有明示、暗示和任何形式的法定保证，包括但不限于适合某以特定用途的适销性的隐含保证、非侵权。 晓易信息及其附属公司、合作伙伴、许可人，和供应商不保证该服务或其任何部分，包括但不限于任何用户内容，不会中断或没有错误，不保证没有病毒或其他有害成分，不保证任何前述事项将被校正。您理解并同意，您在您自己的风险判断下使用、访问、下载，或通过服务获取信息、材料、软件、内容或数据，您将对您在下载和使用这些材料或数据的过程中的财产（包括您的计算机系统、手持设备，或其他与服务相连的外围设备）损失和数据丢失承担全部责任。
                <br><br>
                限制
                <br><br>
                适用的法律可能不允许限制或排除偶然或间接损失的责任，因此上述限制或排除可能对您不适用。在这种情况下，您同意免责声明和责任限制所表达的您和晓易信息之间的一个合理和公平的风险分配，这是您和晓易信息之间合作的基础，晓易信息的责任将仅限于在法律允许的最大范围内。您了解并同意没有这些限制晓易信息将不能在经纪可行的基础上提供服务给您。
                <br><br>
                适用法律和司法管辖权
                <br><br>
                本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。
                <br><br>
                凡因本协议引起的或与本协议有关的任何争议，均应提交中国国际经济贸易仲裁委员会香港仲裁中心，按照仲裁申请时中国国际经济贸易仲裁委员会现行有效的仲裁规则进行仲裁。仲裁裁决是终局的，对双方均有约束力。
              </p>
              <h2>注意事项</h2>
              <p>
                晓易信息可以为您提供通过电子邮件、普通邮件或发布在服务的通知。如果通知是通过电子邮件提供的，通知将在电子邮件发送24小时后被视为送达，除非发送方被通知电子邮件地址无效。如果通知是通过服务发布的，那么在您查看过后通知将被视为送达。另外，我们可以为您将法律通知邮寄到邮政地址，如果通过服务您提供了邮政地址。在这种情况下，通知将被视为邮寄之日起三天后送达。
                <br><br>
                建议
                <br><br>
                我们欢迎您来信向我们提出有关服务的意见建议。如果您给我们一个经营理念或建议（例如，如何提高或扩大我们的产品和服务），您同意，我们将可以以任何方式完全自由地实施、使用或修改您的想法或建议（或其任何部分），没有任何付款或其他义务给您。
                <br><br>
                协议的完整性和可分割性
                <br><br>
                本《服务协议》是相对于服务，建立在您和晓易信息之间，并取代所有以前或同期的通讯和建议（无论是口头，书面或电子）的全部协议。如果发现这些服务条款中的某一条款无法执行或无效，该条款将被限制或消除到必要的最低限度，从而使这些服务条款仍然具有十足效力及作用，并强制执行。除非经双方签署的书面文件，或服务条款发生如上所述的修订，否则这些条款不得修改或放弃。晓易信息未能在任何一个或多个实例中执行这里的条款，不应被解释为对该条款的先前或未来表现的放弃。您同意您和晓易信息之间不因这些条款和使用服务而产生任何合资、合伙、雇佣或代理关系。您进一步承认您和晓易信息之间不因遵照服务协议提交用户内容而产生任何机密、信托、暗示合同或其他关系。您不得转让和分配本《服务协议》所授予的任何权利和许可。但是晓易信息在本协定适用范围内依法不受限制地分配、重组，重新纳入、合并或出售全部或实质上全部的操作资产。任何违反这些条款的转让企图均属无效。
              </p>
              <h2>其他</h2>
              <p>
                1．不可抗力
                <br><br>
                晓易信息对于由于超出晓易信息合理控制范围而引起的履行义务的失败不负责，包括但不限于战争、自然灾害、所在国法律、机械、电子或通信故障或性能下降。
                <br><br>
                2．分配
                <br><br>
                这些服务协议是针对您个人的，没有晓易信息事先的书面同意您是不能转让或再授权的。晓易信息可以在未经同意的情况下转让、转移或授予任何权利和义务。
                <br><br>
                3．机构
                <br><br>
                任何因这些服务条款而建立的代理、合伙、合资或雇佣关系，双方都没有在任何方面以任何形式去约束另一方的权利。
                <br><br>
                4．通知
                <br><br>
                除非本《服务协议》中另有规定，本服务条款下的所有通知都将以书面形式发送。如果亲自送达或发送挂号信，则在收到回执时视为已送达；如果通过传真或电子邮件传送，在收到电子确认时视为已送达；如果以次日到达快递发出，则发出次日视为已送达。
                <br><br>
                5．不弃权
                <br><br>
                晓易信息执行这些服务条款的某一部分失败不构成对其以后强制执行本服务条款的任何其他部分的权利的放弃。遵守任何特定实例的放弃，并不意味着我们会在将来也会如此。为了对于遵守这些服务条款进行约束，晓易信息必须向您提供由其授权代表之一提供的书面弃权通知。
                <br><br>
                6．标题
                <br><br>
                在这些服务条款的章节和段落，标题仅为方便，并不影响其解释。
              </p>
              <p>上海晓易信息技术有限公司</p>
            </div>
            <div class="tab-pane" id="privacy">
              <p>
                本隐私政策描述了上海晓易信息技术有限公司（以下简称“晓易信息”）在您使用本网站服务、功能、内容或应用程序时对您的相关信息的收集、使用和披露的政策和程序。
                <br><br>
                本网站可能通过以下途径获取您的信息：
                <br><br>
                1. 当您注册本网站和服务时通过您在本网站的用户账户获取；
                <br><br>
                2. 当您使用服务时；
                <br><br>
                3. 通过第三方网站和服务获取，包括晓易信息拥有的其他的应用和服务。
                <br><br>
                您使用我们的服务即意味着您同意我们收集、传输、存储、披露您的信息以及将您的信息用作本《隐私政策》中描述的其他用途。您所提供的信息将可能被我们在中国或者其他国家传输、处理和访问。
              </p>
              <h2>本《隐私政策》包含哪些内容？</h2>
              <p>
                本《隐私政策》涵盖了对于您使用我们服务时本网站所收集的信息的处理，也涵盖了对于本网站商业伙伴或者晓易信息其他的应用和服务分享的您的信息的处理。
                <br><br>
                本《隐私政策》不适用于不属于晓易信息拥有和控制的其他企业的做法，包括您能通过本网站访问的其他公司的网站、服务和应用（第三方服务）。虽然我们只选择与那些认同我们对您隐私的尊重的第三方服务合作，但是我们不能对这些第三方服务的内容和隐私政策负责。因此，我们建议您去查看您所访问的第三方服务的隐私政策。
              </p>
              <h2>本网站收集哪些信息以及我们如何使用这些信息？</h2>
              <p>
                我们收集的这些信息主要是用于提供服务、处理和完成交易、响应查询、个性化和改善服务、监控和分析使用情况和服务趋势，为您提供相关的信息等。在服务相关的某些方面,我们会要求收集或显示一些您的信息。我们收集用户以下信息:
                <br><br>
                用户信息：
                <br><br>
                当您创建账户时，我们会收集您的个人信息，例如您的姓名和电子邮件地址。如果您使用已经登录的其他账户来在本网站创建账户，我们会访问和收集您在那个账户中所提供的个人信息（基于您的隐私设置）。我们可能使用您的联系信息来向您发送我们的服务信息，您可以通过账户设置来取消订阅此类消息，但必要时本网站和晓易信息保留联系您的权利，比如出于行政和账户管理的目的。
                <br><br>
                关于未成年人使用我们的服务:我们不会有意收集未成年人的个人信息。如果我们了解到我们收集了18岁以下未成年人的个人信息,我们将采取必要的步骤来从我们的系统通知中删除这些信息。
                <br><br>
                指标和分析：
                <br><br>
                本网站收集由本网站服务所创建的每一个链接的访问（例如点击）信息。这里的信息包括但不仅限于：
                <br><br>
                访问链接的设备的IP地址和实际位置；
                <br>
                相关的网址和设备；
                <br>
                每次访问的时间和日期；
                <br>
                这些指标和信息将被用于本网站及本网站合作伙伴提高服务质量，例如提供增值功能等。
                <br><br>
                用户内容：
                <br><br>
                本服务的某些功能允许您提供一些内容服务，比如书面描述、评论、图片和视频等。您向服务器提交的所有内容都会被本网站保留,即使在您注销了账户以后这些内容也可能被第三方按照本《隐私政策》中的描述进行分享。
                <br><br>
                自动收集的信息：
                <br><br>
                本网站会自动接收并记录您的浏览器和服务器日志上的信息，其中包括您的 IP 地址、浏览器类型、一般位置和 cookie信息。这些信息将用于帮助我们理解用户如何传播网站,用来打击垃圾邮件/恶意软件,促进有关您与服务交互数据的集合以及其他相似的用途。
                <br><br>
                当您访问服务时本网站也会自动接收和记录您的移动设备传输信息，例如设备标识符、设备设置和操作系统。这些信息是用来促进您的访问以及提高对本服务的使用频率,访问和使用其他第三方服务以及其他相似的用途。
                <br><br>
                一般情况下，服务器会自动收集使用信息，例如网站访客的数量和频率信息。本网站可以集合形式使用这些数据，也就是说，作为统计的措施，但不是以识别您个人的方式。这种类型的汇总数据使我们和我们授权的第三方了解到个人使用部分服务的频次，使得我们可以分析和改进服务。
                <br><br>
                当您访问网站时，我们会收集您的一般位置信息（例如您的城市和国家，这来自于您的IP地址）。当您通过移动设备访问和使用服务时，我们可以使用各种技术来确定您的位置(如果您启用了这个功能)。
                <br><br>
                当您打开我们发送的邮件时我们会收到确认，我们以此来提升客户服务。
              </p>
              <h2>Cookie 政策</h2>
              <p>
                Cookie是当您访问一个网站时，通过Web浏览器提供给您的计算机的文本片段。您的浏览器以您访问的每个网站相关联的方式存储cookie。我们使用cookie使我们的服务器识别出您的Web浏览器，并告诉我们您访问我们网站和通过网络使用服务的方式和时间。
                <br><br>
                本网站的cookie也使得本网站可以在您点击一个短链接时进行跟踪。短链接的每一次点击都使用分配给您的，存储在与本网站相关的web浏览器上的一个或多个cookie上的唯一标识符进行跟踪。
                <br><br>
                本网站的cookie不包含任何关于您的个人信息,我们不把通过cookie收集的一般信息和您的个人信息相结合来确定您的身份。然而,我们使用cookie来识别出您的web浏览器访问了本网站的链接,同时如果您拥有本网站的账户，则可以将这些信息与您的账户相关联。
                <br><br>
                大多数浏览器有一个关掉cookie功能的选项,这将阻止您的浏览器接受新cookie,以及允许您决定以多种方式接受新cookie(取决于您的浏览器软件的复杂性)。如果您禁用cookie,您将不能使用大多数的特色服务。本网站的cookie被设置成一个月后自动失效。
                <br><br>
                您可能也会要求本网站不要在您的web浏览器上放置cookie。当cookie以这种方式被禁用，点击本网站的链接将不会绑回或与您的web浏览器相关联。
                <br><br>
                本《隐私政策》只涵盖本网站cooike的使用，不包含任何第三方服务对与cookie的使用。本网站不控制第三方在您的电脑上放置cookie的时间和方式，例如当您从本网站的链接访问一个网址时。
                <br><br>
                如果您是晓易信息的多个应用程序和服务的用户,我们可以将本网站的cookie与那些应用程序和服务的cookie相结合，以此为您提供单点登录服务。这是为了使您更容易地访问多个服务，同时限制了每一次当您注册我们的服务时所需要提供的信息量。此外,它会为您提供相关的内容或信息,并协助本网站的行政和账户管理功能。
                <br><br>
                本网站的服务可能会以匿名或者集合形式（即非个人身份）与我们的客户和商业伙伴分享。这些信息使我们能够更好地了解到用户如何使用我们的产品和服务以及其他的产品和服务，了解用户的兴趣以及我们的服务如何与他们的服务进行互操作，产品开发，市场营销优化和研究，并提高通过服务所展示的在线广告和营销的相关性（或使其符合您的利益）。
                <br><br>
                请谨记如果您选择提供关于您使用特定功能的服务信息，这些信息将受该特定功能的隐私设置所管理，从而可以被其他人公开访问。
                <br><br>
                IP地址信息：
                <br><br>
                我们收集和存储IP地址信息但这些信息是非公开的。我们有时与我们的合作伙伴、服务提供商以及与我们开展业务的其他公司分享IP地址信息，但大多数情况下，当我们和第三方分享IP地址信息时，我们会使用加密打乱的IP地址，从而使其不能有效逆转成实际的IP地址或单独链接到您。
                <br><br>
                用户配置文件信息：
                <br><br>
                用户配置文件信息包括用户名和邮箱、手机号（您的账户已与这些服务相联），同时您输入的其他信息也会显示给其他用户以促进服务中的用户交互。但用户的电子邮件地址不会通过本网站直接透露给其他用户。
                <br><br>
                与本网站服务供应商的信息分享：
                <br><br>
                我们将代表本网站和我们的服务供应商与个人或其他实体以雇佣和合同的方式来完成特定的任务。为了给您提供产品和服务，我们需要和我们的服务供应商分享您的信息。除非我们另行通知您，否则我们的服务供应商没有任何超过为我们提供服务的目的而使用我们分享给他们的您的信息的权利。
                <br><br>
                根据业务转让披露的信息：
                <br><br>
                用户的信息在我们出售公司资产或其他情况下有可能会作为我们企业资产之一而被转让。在这种情况下，本网站的收购方可以继续根据本政策使用您的信息。
                <br><br>
                出于保护本网站及其他目的而披露的信息：
                <br><br>
                本网站保留在必要时访问、读取、储存和披露任何信息的权利：
                <br><br>
                1. 遵守所有适用法律、法规，应法律程序或政府要求；
                <br><br>
                2．执行这些服务条款，包括对潜在违规行为展开调查；
                <br><br>
                3. 检测，防止或解决欺诈，安全或技术问题;
                <br><br>
                4．响应用户支持请求。
                <br><br>
                5．保护本网站用户和公众的权利、财产和安全。这包括与其他公司和组织为防止欺诈和垃圾邮件/恶意软件防范交换信息。
                <br><br>
                根据您的同意我们分享的信息：
                <br><br>
                我们会在下列情况下分享您的信息：当您和其他人分享本网站的链接和内容时；我们告知您,您提供的信息将会以一种特定的方式被分享时；您在第三方服务分享或发布信息时。
                <br><br>
                我的信息是怎样被保护的？
                <br><br>
                您的账户信息通过您的密码来保护您的隐私和安全。您可以适当的选择和保护您的密码来阻止非法访问，同时您也可以通过在您完成对账户访问后退出登录来限制对于您的计算机和浏览器的访问。
                <br><br>
                我有什么选择,我可以访问我的什么信息?
                <br><br>
                您不需要一个帐户访问我们的部分服务，在没注册的情况下您可以使用许多服务的功能，从而限制了被单独收集的有关您的信息。
                <br><br>
                如果您是一个注册用户，您可以通过登录网站来访问和您账户有关的信息。您可随时联络我们或者通过设置页面的功能停用您的账户。如果您关闭了您的账户，您将不能再访问和使用本服务。
                <br><br>
                在本《隐私政策》变更后怎么办?
                <br><br>
                本网站可能适时修订本《隐私政策》的条款，如果我们在收集和使用信息的方式上发生重大的改变，我们会通过发布公告或给您发送电子邮件的方式来通知您，同时我们也将在通知中写明修订后的《隐私政策》生效的时间。在该种情况下，若您继续使用我们的服务，即表示同意受修订后的《隐私政策》的约束。
                <br><br>
                在阅读完本政策之后，如您对本《隐私政策》或与本《隐私政策》相关的事宜有任何问题，请与 legal@risktogo.com联系。
              </p>
              <p>上海晓易信息技术有限公司</p>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
    import {mapGetters} from "vuex";

    export default {
      layout: 'basic',

      created() {
        if (!this.authenticated) document.body.className += ' public-page-top'
      },

      beforeRouteEnter(to, from, next) {
        if (to.name == 'terms-and-conditions') {
          next(vm => {
            vm.current = 'terms'
          })
        } else if (to.name == 'privacy') {
          next(vm => {
            vm.current = 'privacy'
          })
        } else {
          next()
        }
      },

      beforeRouteLeave (to, from, next) {
        document.body.className = ''
        next()
      },

      data: () => ({
        title: window.config.appName,
        current: 'terms',
      }),

      computed: {
        ...mapGetters({
          authenticated: 'auth/check',
        })
      }
    }
</script>

<style scoped>

</style>
